using System;

namespace Homework_Theme_04_3
{
    class Program
    {
        static void Main(string[] args)
        { // 
          // * Задание 3.1
          // Заказчику требуется приложение позволяющщее умножать математическую матрицу на число
          // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)
          // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)#Умножение_матрицы_на_число
          // Добавить возможность ввода количество строк и столцов матрицы и число,
          // на которое будет производиться умножение.
          // Матрицы заполняются автоматически. 
          // Если по введённым пользователем данным действие произвести невозможно - сообщить об этом
          //
          // Пример
            Console.OutputEncoding = System.Text.Encoding.UTF8; //Кодировка вывода консоли
            Console.WriteLine("Программа умножения матриц");
            Console.WriteLine("Введите количество строк в матрице");
            int col = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine("Введите количество столбцов в матрице");
            int row = Convert.ToInt32(Console.ReadLine());
            int[,] myArray = new int[col,row];

            Random random = new Random();
            Console.WriteLine($"Матрица");
            for (int i = 0; i < col; i++)
            {
                for (int j = 0; j < row; j++)
                {
                    myArray[i, j] = random.Next(-10, 10);
                    Console.Write($"{myArray[i, j],5} ");
                }
                Console.WriteLine("");
            }

            Console.Write("Введите множитель:");
            int x = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine("Матрица после умножения");
            for (int i = 0; i < col; i++)
            {
                for (int j = 0; j < row; j++)
                {
                    myArray[i, j] *=  x;
                    Console.Write($"{myArray[i, j],5} ");
                }
                Console.WriteLine("");
            }
            Console.ReadKey();

            //
            //
            // ** Задание 3.2
            // Заказчику требуется приложение позволяющщее складывать и вычитать математические матрицы
            // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)
            // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)#Сложение_матриц
            // Добавить возможность ввода количество строк и столцов матрицы.
            // Матрицы заполняются автоматически
            // Если по введённым пользователем данным действие произвести невозможно - сообщить об этом
            //
            // Пример
            //  |  1  3  5  |   |  1  3  4  |   |  2   6   9  |
            //  |  4  5  7  | + |  2  5  6  | = |  6  10  13  |
            //  |  5  3  1  |   |  3  6  7  |   |  8   9   8  |
            //  
            //  
            //  |  1  3  5  |   |  1  3  4  |   |  0   0   1  |
            //  |  4  5  7  | - |  2  5  6  | = |  2   0   1  |
            //  |  5  3  1  |   |  3  6  7  |   |  2  -3  -6  |
            //
            // *** Задание 3.3
            // Заказчику требуется приложение позволяющщее перемножать математические матрицы
            // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)
            // Справка https://ru.wikipedia.org/wiki/Матрица_(математика)#Умножение_матриц
            // Добавить возможность ввода количество строк и столцов матрицы.
            // Матрицы заполняются автоматически
            // Если по введённым пользователем данным действие произвести нельзя - сообщить об этом
            //  
            //  |  1  3  5  |   |  1  3  4  |   | 22  48  57  |
            //  |  4  5  7  | х |  2  5  6  | = | 35  79  95  |
            //  |  5  3  1  |   |  3  6  7  |   | 14  36  45  |
            //
            //  
            //                  | 4 |   
            //  |  1  2  3  | х | 5 | = | 32 |
            //                  | 6 |  
            //

        }
    }
}
